import Heroes from "./Main";

function Heroeslist() {
    return (
        <>
            <Heroes
                name="Железный человек"
                universe="Marvel Comics"
                alterego="Тони Старк"
                occupation="гений, миллиардер, плейбой, филантроп"
                friends="Мстители"
                superpowers="высокий уровень интеллекта, широкие познания науки и техники, связь со всемирной паутиной, бронекостюмы"
                info="Пожалуй, самый популярный современный супергерой. У него много общего с мрачной птицей ночи Бэтменом: оба потеряли родителей в детстве, стали борцами с преступностью без особых сверхсил, невероятно богатые. Только если Бэтменом восхищаются, то Тони Старка — обожают :) То ли дело в шикарной актерской игре Роберта Дауни мл., который выбил роль у Николаса Кейджа и Тома Круза, то ли в хорошо прописанном персонаже. Прототипом для героя послужили Илон Маск и изобретатель Говард Хьюз. Железный Человек не всегда ходил в красном модном костюме: в своих первых версиях 1963 года он был скромного серого цвета. Увы, в киновоплощении бронекостюм даже не из металла — его делали из пластика и стекловолокна."
            />
            <Heroes
                name="Капитан Америка"
                universe="Marvel Comics"
                alterego="Стивен Роджерс"
                occupation="супер-солдат"
                friends="Мстители"
                superpowers="сила, выносливость, бессмертие, быстрая регенерация, мастерство скрытности и боя"
                info="Капитан Америка — персонаж, целеноправленно созданный, чтобы воплощать идеалы патриотизма. Потому он был особенно популярный во время Второй мировой войны. В комиксах обращение «Капитан Америка» применяется к любому, кто выбран правительством США. Больше всего оно закрепилось именно за Стивом Роджерсом. Стив родился в 1917 году в семье ирландских эмигрантов Сары и Джозефа Роджерсов. В детстве он был очень слабым юношей и постоянно подвергался насмешкам со стороны других ребят. Ирландские корни давали о себе знать, потому парень от драки не лез. В начале Второй мировой войны Стивен стремился попасть на фронт. Естественно, из-за здоровья ему отказывали. По воле судьбы ему предложили принять участие в секретном оборонном проекте, целью которого было создание суперсолдат. Несмотря на сложности во время эксперимента, результат был успешным. Роджерс превратился из хилого юноши в настоящего Аполлона. Актер Крис Эванс с этой ролью вполне справился:)"
            />
            <Heroes
                name="Тор"
                universe="Marvel Comics"
                alterego="нет; полное имя — Тор Одинсон"
                occupation="борец за справедливость, скандинавский бог"
                friends="Мстители"
                superpowers="всё, что может бог, плюс молот Мьелнир"
                info="Персонаж Тора основан на образе одноименного скандинавского бога. Тор во вселенной Marvel — родной сын Одина и древнейшей богини Геи. После рождения сына Один забрал его в Асгард, где растил вместе со своей женой, богиней Фригг. Последнюю Тор всегда считал своей настоящей матерью и лишь много позже узнал правду о своем рождении. Стоит сказать, что до нынешнего Тора в исполнении Криса Хемсворта у супергероя было несколько воплощений. В одном из них он погиб в схватке с мифическим змеем Мидгардом. Это привело к Рагнареку — некоему апокалипсису в скандинавской мифологии."
            />
        </>
    );
}

export default Heroeslist;